In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [15]:
dataset = pd.read_csv("dataset/student.csv")

In [16]:
dataset.head(3)

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0

In [17]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB

In [13]:
dataset.select_dtypes(["float64"])

      Age  Marks
0    25.0   85.0
1    26.0   86.0
2     NaN   87.0
3    28.0   89.0
4    30.0   85.0
..    ...    ...
96   22.0   77.0
97   28.0   85.0
98   24.0   80.0
99   30.0    NaN
100  26.0   88.0

[101 rows x 2 columns]

In [14]:
dataset.select_dtypes(["float64"]).corr()

            Age     Marks
Age    1.000000  0.291146
Marks  0.291146  1.000000

In [9]:
dataset.select_dtypes(["int64", "float64"]).cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked
PassengerId,66048.060811,-0.628378,-7.578829,38.062815,-16.362613,-0.343468,162.247971,2.680180
Survived,-0.628378,0.236448,-0.136193,-1.006409,-0.018269,0.032620,6.169322,-0.065369
Pclass,-7.578829,-0.136193,0.696724,-1.814888,0.075226,0.011330,-22.740426,0.108880
Age,38.062815,-1.006409,-1.814888,315.301555,-3.072547,-3.082704,-2.918078,-1.756616
SibSp,-16.362613,-0.018269,0.075226,-3.072547,1.218164,0.369119,8.824866,0.060234
Parch,-0.343468,0.032620,0.011330,-3.082704,0.369119,0.650863,8.721729,0.025848
Fare,162.247971,6.169322,-22.740426,-2.918078,8.824866,8.721729,2469.841935,-8.908691
Embarked,2.680180,-0.065369,0.108880,-1.756616,0.060234,0.025848,-8.908691,0.627403